<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,10,4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_3410_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 3" offset="0" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_3410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_3405_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="6" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_3405" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_3402_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="518" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_3402" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_3397_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1542" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_3397" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_3394_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="2054" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_3394" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_3315_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="3078" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_3315" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_128" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3590" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_167">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_143" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="15" name="/model/encoders/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3606" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_169">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_146" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="/model/encoders/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_132" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_171">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_149" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="/model/encoders/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_2_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_134" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3614" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_173">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_152" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="24" name="/model/encoders/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_3_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/model/encoders/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3590" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_output_0" />
			</output>
		</layer>
		<layer id="26" name="Constant_155" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="/model/encoders/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_4_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model/encoders/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3606" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="29" name="Constant_157" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="30" name="/model/encoders/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_5_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model/encoders/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Mul_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model/encoders/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model/encoders/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model/encoders/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="35" name="Constant_162" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="/model/encoders/Gather_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_6_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model/encoders/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Mul_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model/encoders/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model/encoders/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/model/encoders/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3614" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="41" name="Constant_168" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3598" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/model/encoders/Gather_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/encoders/Gather_7_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model/encoders/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Mul_2_output_0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/encoders/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/encoders/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model/encoders/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/Unsqueeze_2_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model/encoders/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32" names="/model/encoders/Concat_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Transpose_2646_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 7" offset="3630" size="3584" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_2646" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model/encoders/fc1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/fc1/MatMul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model/encoders/fc1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/fc1/Add_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_3329_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="7214" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_3329" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_3316_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="7726" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_3316" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Transpose_2653_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 256" offset="9774" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_2653" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model/encoders/layers.0/self_attn/wq/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model/encoders/layers.0/self_attn/wq/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/linear/Add_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_178" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model/encoders/layers.0/self_attn/wq/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Div_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_3317_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="534062" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_3317" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/encoders/layers.0/self_attn/wq/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Mul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_3318_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="536110" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_3318" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model/encoders/layers.0/self_attn/wq/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wq/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model/encoders/layers.0/self_attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538158" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model/encoders/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_194" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538190" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model/encoders/layers.0/self_attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_3319_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="538222" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_3319" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Transpose_2669_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 256" offset="540270" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transpose_2669" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model/encoders/layers.0/self_attn/wk/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model/encoders/layers.0/self_attn/wk/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/linear/Add_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_198" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model/encoders/layers.0/self_attn/wk/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Div_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_3320_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="1064558" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_3320" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model/encoders/layers.0/self_attn/wk/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Mul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_3321_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="1066606" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_3321" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model/encoders/layers.0/self_attn/wk/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wk/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/model/encoders/layers.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538158" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model/encoders/layers.0/self_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_231" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1068654" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/encoders/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_3322_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="1068686" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_3322" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Multiply_3251" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/model/encoders/layers.0/self_attn/Div" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Div_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model/encoders/layers.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/encoders/layers.0/self_attn/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_3323_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1068688" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_3323" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Transpose_2685_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="1069200" size="131072" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Transpose_2685" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model/encoders/layers.0/self_attn/wv/linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/linear/MatMul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model/encoders/layers.0/self_attn/wv/linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/linear/Add_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_214" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3622" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model/encoders/layers.0/self_attn/wv/norm/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Div_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_3324_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1200272" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_3324" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model/encoders/layers.0/self_attn/wv/norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Mul_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_3325_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1200784" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_3325" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model/encoders/layers.0/self_attn/wv/norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/wv/norm/Add_1_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model/encoders/layers.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1201296" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/model/encoders/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_229" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538190" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/model/encoders/layers.0/self_attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/model/encoders/layers.0/self_attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_238" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538190" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/model/encoders/layers.0/self_attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Transpose_3_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/model/encoders/layers.0/self_attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1201328" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/model/encoders/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_3326_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1201352" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_3326" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/model/encoders/layers.0/self_attn/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1201328" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/encoders/layers.0/self_attn/Constant_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/model/encoders/layers.0/self_attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/encoders/layers.0/self_attn/Reshape_4_output_0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Transpose_2701_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="1201864" size="131072" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Transpose_2701" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
